Infineon/XMC-for-Arduino/arm/variants/XMC1100/config/XMC1100_H_BRIDGE2GO/xmc_config.h
/*
  xmc_config.h - Variant specific definitions
  Part of Arduino - http://www.arduino.cc/

  Copyright (c) 2007 David A. Mellis

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General
  Public License along with this library; if not, write to the
  Free Software Foundation, Inc., 59 Temple Place, Suite 330,
  Boston, MA  02111-1307  USA
  
  Copyright (c) 2020 Infineon Technologies AG
  This file has been modified for the XMC microcontroller series.
*/
#ifndef XMC_CONFIG_H_
#define XMC_CONFIG_H_

//****************************************************************************
// @Project Includes
//****************************************************************************
#include <XMC1100.h>

//****************************************************************************
// @Defines
//****************************************************************************
// XMC_BOARD for stringifying into serial or other text outputs/logs
// Note the actual name XMC and number MUST have a character between 
// to avoid issues with other defined macros e.g. XMC1100
#define XMC_BOARD           XMC 1100 H-BRIDGE2GO
/* On board LED is ON when digital output is 1, HIGH, TRUE, ON */
#define  XMC_LED_ON         1

//#define NUM_DIGITAL_PINS    12
#define NUM_ANALOG_INPUTS   2
#define NUM_PWM             2
#define NUM_LEDS            2
#define NUM_INTERRUPT       1
#define NUM_SERIAL          1
#define NUM_TONE_PINS       2
#define NUM_TASKS_VARIANT   8

// Indicate unit has RTC/Alarm
#define HAS_RTC             1

// Defines will be either set by ArduinoIDE in the menu or manually
#ifdef SERIAL_HOSTPC
  // Comment out following line to use Serial on pins (board)
  #define SERIAL_DEBUG    1
#elif SERIAL_ONBOARD
  // No SERIAL_DEBUG will be defined, kept here for clarity
#else
  // Define the SERIAL_DEBUG as default setting
  #define SERIAL_DEBUG    1
#endif

#define PWM4_TIMER_PERIOD (2041U)  // Generate 490Hz @fCCU=64MHz

#define PCLK 64000000u 
 
#define PIN_SPI_SS    3
#define PIN_SPI_MOSI  1
#define PIN_SPI_MISO  0
#define PIN_SPI_SCK   2

extern uint8_t SS; 
extern uint8_t MOSI;
extern uint8_t MISO;
extern uint8_t SCK;

#define A0   0
#define A1   1

#define LED_BUILTIN 14	//Standard Arduino LED: Used LED1
#define LED1    14  	// Extended LEDs
#define LED2    15  	// Extended LEDs
#define GND     32  	// GND

// H-BRIDGE2Go specific Pins
#define SO 		PIN_SPI_MISO
#define SI 		PIN_SPI_MOSI
//#define SCK 	PIN_SPI_SCK
#define CSN 	PIN_SPI_SS
#define DIR		6
#define DIS		10
#define PWM 	11

#define digitalPinToInterrupt(p)    (((p) == 9) ? 0 : NOT_AN_INTERRUPT)

#endif
